# =============================================================================
# prop_prediction/predictor.py
# =============================================================================
# Главный интерфейс предсказания свойств белков.
#
# Часть проекта с проектной смены "Большие Вызовы"
#
# Лицензия: MIT (см. LICENSE)
# =============================================================================

class PropertiesPredictor:
    def __init__(self):
        pass

    def predict(protein):
        pass